{
  "main": {
    "name":"Jaya Sai Krishna Muppalla",
    "firstName": "Jaya Sai Krishna",
    "lastName": "Muppalla",
    "occupation":"Software Engineer",
    "description":"Currently working as Backend developer in Samsung",
    "bio":"A programming enthusiast, who is always eager to learn new technologies and develop something fun.",
    "contactmessage":"Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email.",
    "email": "jayasai470@gmail.com",
    "phone": "618-946-5202",
    "address":{
      "city":"Dallas",
      "state":"Texas"
    },
    "website": "https://jayasai470.github.io",
    "resumedownload":"jay.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/jaya-sai-krishna-muppalla-0b99951a0/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/jayasai470",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Experience in designing, developing, deploying and maintaining highly available, scalable rest api's which are battle tested and performance optimized using java, nodejs and aws",
    "education":[
      {
        "school":"University of Missouri Kansas City (UMKC)",
        "degree":"Masters in Computer Science",
        "graduated":"May 2015",
        "dateFrom":"Aug 2013",
        "dateTo": "May 2015"
      },
      {
        "school":"Jawaharlal Nehru Technological University",
        "degree":"Bachelor's in Electronics and Communication Engineering",
        "graduated":"April 2013",
        "dateFrom": "May 2009",
        "dateTo": "April 2013"
      }
    ],
    "work":[
      {
        "company":"Samsung Electronics America",
        "title":"Engineer 3, Software Process engineering",
        "years":"March 2022 - Present",
        "dateFrom": "March 2022",
        "dateTo": "present",
        "description": "Developed a GPT-based movie recommendation system to enhance user experience through personalized suggestions. Conducted research and development on custom Retrieval-Augmented Generation (RAG) techniques aimed at delivering tailored movie recommendations. Utilized the LangChain framework in conjunction with Azure OpenAI and OpenAI's language model providers to implement sophisticated AI-driven features. Integrated various vector database stores, including Azure AI Search and Redis vector module, to optimize data retrieval and storage processes. Transitioned the existing logging and observability infrastructure to an OpenTelemetry-based approach, enabling unified collection and analysis of logs, metrics, and traces. Developed a low-latency game streaming platform ensuring high-performance delivery. Engineered automation for virtual game machine provisioning using KubeVirt (Kubernetes + Virtual Machines) for both AWS and OCI metal machines. Implemented game execution on virtual machines with both Nvidia and AMD GPUs using vGPU/SR-IOV on Windows/Linux systems. Innovated an economical method to make game machines accessible by designing a custom Kubernetes host port operator. Established and managed a Rook + Ceph storage cluster to facilitate Read-Only Many (ROX) persistent volume claims, compensating for AWS's lack of native support. Customized the Puppetlabs pvpool controller for Kubernetes volume snapshot making replica creation instant."
      },
      {
        "company":"Samsung Electronics America",
        "title":"Engineer 2, Software Process engineering",
        "years":"July 2019 - Feb 2022",
        "dateFrom": "July 2019",
        "dateTo": "Feb 2022",
        "description": "Developed NodeJs backend services and successfully deployed them on Kubernetes (EKS) utilizing Helm charts. Developed an indoor positioning system using beacon technology for proximity detection and contributed to contact tracing solutions for wearable devices. Utilized Apache Flink for real-time stream processing and implemented Complex Event Processing (CEP) for advanced event pattern detection. Designed and implemented microservices using a Function-as-a-Service (FAAS) model, adopting an event-driven architecture hosted on AWS, with deployment automation via Serverless framework. Built fully reactive applications leveraging Spring WebFlux, MongoDB, and Kafka for responsive and scalable solutions. Automated the deployment process for single-page React applications using a combination of CDN, Amazon S3, Jenkins, and CircleCI for efficient content delivery."
      },
      {
        "company":"Samsung Electronics America (Contractor)",
        "title":"Server Engineer",
        "years":"Aug 2015 - July 2019",
        "dateFrom": "Aug 2015",
        "dateTo": "July 2019",
        "description":"Implemented GeoSpatial queries and GeoHashing for Geofence and location-based alert functionalities. Utilized various mapping APIs such as OpenStreetMaps, Leaflet, Google Maps, and HERE Maps for geocoding and data visualization. Gained comprehensive experience in app development, including working with client-side, server-side, CMS (Magnolia), persistence layers, and streaming services (Kafka). Conducted rapid prototyping for proof of concepts with emerging technologies, ensuring their maturity for production-grade deployment on AWS."
      }
    ],
    "skills":[
      {
        "name":"Java, NodeJs",
        "level":"95%",
        "rating": 5,
        "label": "Expertise"
      },
      {
        "name": "SpringBoot, Express, NestJS",
        "level": "95%",
        "rating": 4,
        "label": "Advanced"
      },
      {
        "name": "GoLang, Python",
        "level": "70%",
        "rating": 3,
        "label": "Intermediate"
      },
      {
        "name": "AWS",
        "level": "95%",
        "rating": 5,
        "label":"Expertise"
      },
      {
        "name": "Azure, OCI",
        "level": "70%",
        "rating": 3,
        "label":"Intermediate"
      },
      {
        "name": "Kafka, Kinesis, Flink",
        "level": "70%",
        "rating": 3,
        "label": "Intermediate"
      },
      {
        "name":"Kubernetes, Helm, Docker",
        "level":"95%",
        "rating":5,
        "label":"Expertise"
      },
      {
        "name":"Devops, Terraform, Serverless",
        "level":"90%",
        "rating":4,
        "label":"Advanced"
      },
      {
        "name": "MongoDB, Redis, Mysql",
        "level": "90%",
        "rating":4,
        "label":"Advanced"
      },
      {
        "name": "Rest, WebSocket, MQTT, GraphQL",
        "level": "90%",
        "rating":4,
        "label":"Advanced"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Resume Site",
        "category":"Resume from code",
        "url":"/resume.html",
        "image": "./portfolio-resume.png"
      }
    ]
  }
}
